import os, re, pathlib, datetime, time, copy
import sys

def read_dir(name_dir: str) -> list:
    """
    Считывает файлы из папки 
    """
    list_files = []
    for file in os.listdir(name_dir):
        filename = ''.join(c for c in file if c.isprintable())
        try:
            os.rename(file, filename)
        except FileNotFoundError:
            pass
        list_files.append(file)
    return list_files

def data_file(filename):
    """
    Функция даты файлов
    """
    ti_m = os.path.getmtime(filename)
    m_ti = time.ctime(ti_m)
    t_obj = time.strptime(m_ti)
    T_stamp = time.strftime("%Y.%m.%d", t_obj)
    return T_stamp

def pattern_(file: str):
    """Файл PDFный???"""
    pdf_ = re.fullmatch(r'.*.pdf', file)
    dwg_ = re.fullmatch(r'.*.dwg', file)
    exe_ = re.fullmatch(r'.*.exe', file)
    png_ = re.fullmatch(r'.*.png', file)
    jpg_ = re.fullmatch(r'.*.jpg', file)
    tiff_ =re.fullmatch(r'.*.tiff', file)
    if pdf_ or exe_ :
        return True
    
def pattern_all(file: str):
    """Файл PDFный???"""
    pdf_ = re.fullmatch(r'.*.pdf', file)
    dwg_ = re.fullmatch(r'.*.dwg', file)
    exe_ = re.fullmatch(r'.*.exe', file)
    png_ = re.fullmatch(r'.*.png', file)
    jpg_ = re.fullmatch(r'.*.jpg', file)
    tiff_ =re.fullmatch(r'.*.tiff', file)
    if dwg_ or pdf_ or exe_ or png_ or jpg_ or tiff_:
        return True

dict_name = {
            "03.2 ППТ3-4-Д1-П-АР2_Лист 1_План -3 этажа. Фрагмент 1. М 1ː100": [r".*АР2-1.\w{3}", r".*Лист-План -3-го этажа. Фрагмент 1.\w{3}", r".*-Лист -.*План -3-го этажа. Фрагмент 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 2_План -3 этажа. Фрагмент 2. М 1ː100": [r".*АР2-2.\w{3}", r".*Лист-План -3-го этажа. Фрагмент 2.\w{3}", r".*-Лист -.*План -3-го этажа. Фрагмент 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 3_План -3 этажа. Фрагмент 3. М 1ː100": [r".*АР2-3.\w{3}", r".*Лист-План -3-го этажа. Фрагмент 3.\w{3}", r".*-Лист -.*План -3-го этажа. Фрагмент 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 4_План -3 этажа. Фрагмент 4. М 1ː100": [r".*АР2-4.\w{3}", r".*Лист-План -3-го этажа. Фрагмент 4.\w{3}", r".*-Лист -.*План -3-го этажа. Фрагмент 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 5_План -3 этажа. Фрагмент 5. М 1ː100": [r".*АР2-5.\w{3}", r".*Лист-План -3-го этажа. Фрагмент 5.\w{3}", r".*-Лист -.*План -3-го этажа. Фрагмент 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 6_План -3 этажа. Фрагмент 6. М 1ː100": [r".*АР2-6.\w{3}", r".*Лист-План -3-го этажа. Фрагмент 6.\w{3}", r".*-Лист -.*План -3-го этажа. Фрагмент 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 7_План -3 этажа. Фрагмент 7. М 1ː100": [r".*АР2-7.\w{3}", r".*Лист-План -3-го этажа. Фрагмент 7.\w{3}", r".*-Лист -.*План -3-го этажа. Фрагмент 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 8_Экспликация помещений -3 этажа (начало)": [r".*АР2-8.\w{3}", r".*Лист-.*-3-го.*этажа.*(начало).\w{3}", r".*АР2-8.*начало.*\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 9_Экспликация помещений -3 этажа (окончание)": [r".*АР2-9.\w{3}", r".*Лист-.*-3-го.*этажа.*(окончание).\w{3}", r".*АР2-9.*окончание.*\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 10_План -2 этажа. Фрагмент 1. М 1ː100": [r".*АР2-10.\w{3}", r".*Лист-План -2-го этажа. Фрагмент 1.\w{3}", r".*-Лист -.*План -2-го этажа. Фрагмент 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 11_План -2 этажа. Фрагмент 2. М 1ː100": [r".*АР2-11.\w{3}", r".*Лист-План -2-го этажа. Фрагмент 2.\w{3}", r".*-Лист -.*План -2-го этажа. Фрагмент 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 12_План -2 этажа. Фрагмент 3. М 1ː100": [r".*АР2-12.\w{3}", r".*Лист-План -2-го этажа. Фрагмент 3.\w{3}", r".*-Лист -.*План -2-го этажа. Фрагмент 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 13_План -2 этажа. Фрагмент 4. М 1ː100": [r".*АР2-13.\w{3}", r".*Лист-План -2-го этажа. Фрагмент 4.\w{3}", r".*-Лист -.*План -2-го этажа. Фрагмент 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 14_План -2 этажа. Фрагмент 5. М 1ː100": [r".*АР2-14.\w{3}", r".*Лист-План -2-го этажа. Фрагмент 5.\w{3}", r".*-Лист -.*План -2-го этажа. Фрагмент 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 15_План -2 этажа. Фрагмент 6. М 1ː100": [r".*АР2-15.\w{3}", r".*Лист-План -2-го этажа. Фрагмент 6.\w{3}", r".*-Лист -.*План -2-го этажа. Фрагмент 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 16_План -2 этажа. Фрагмент 7. М 1ː100": [r".*АР2-16.\w{3}", r".*Лист-План -2-го этажа. Фрагмент 7.\w{3}", r".*-Лист -.*План -2-го этажа. Фрагмент 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 17_Экспликация помещений -2 этажа (начало)": [r".*АР2-17.\w{3}", r".*Лист-Экспликация помещений -2-го этажа (начало).\w{3}", r".*-Лист -.*Экспликация помещений -2-го этажа (начало).\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 18_Экспликация помещений -2 этажа (окончание)": [r".*АР2-18.\w{3}", r".*Лист-Экспликация помещений -2-го этажа (окончание).\w{3}", r".*-Лист -.*Экспликация помещений -2-го этажа (окончание).\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 19_План -1 этажа. Фрагмент 1. М 1ː100": [r".*АР2-19.\w{3}", r".*Лист-План -1 этажа. Фрагмент 1.\w{3}", r".*-Лист -.*План -1 этажа. Фрагмент 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 20_План -1 этажа. Фрагмент 2. М 1ː100": [r".*АР2-20.\w{3}", r".*Лист-План -1 этажа. Фрагмент 2.\w{3}", r".*-Лист -.*План -1 этажа. Фрагмент 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 21_План -1 этажа. Фрагмент 3. М 1ː100": [r".*АР2-21.\w{3}", r".*Лист-План -1 этажа. Фрагмент 3.\w{3}", r".*-Лист -.*План -1 этажа. Фрагмент 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 22_Экспликация помещений -1 этажа": [r".*АР2-22.\w{3}", r".*Лист-Экспликация помещений -1-го этажа.\w{3}", r".*-Лист -.*Экспликация помещений -1-го этажа.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР2_Лист 23_Разрез 1-1. Разрез 2-2. Разрез 3-3. М 1ː100": [r".*АР2-23.\w{3}", r".*Лист-Разрез 1-1. Разрез 2-2. Разрез 3-3.\w{3}", r".*-Лист -.*Разрез 1-1. Разрез 2-2. Разрез 3-3.\w{3}",],

            "03.2 ППТ3-4-Д1-П-АР3_Лист 1_План 1 этажа. Корпус 12": [r".*АР3-1.\w{3}", r".*Лист-План 1 этажа. Корпус 12.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 2_План 1 этажа. Корпус 1": [r".*АР3-2.\w{3}", r".*Лист-План 1 этажа. Корпус 1.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 3_План 1 этажа. Корпус 2": [r".*АР3-3.\w{3}", r".*Лист-План 1 этажа. Корпус 2.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 4_План 1 этажа. Корпус 3": [r".*АР3-4.\w{3}", r".*Лист-План 1 этажа. Корпус 3.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 5_План 1 этажа. Корпус 11": [r".*АР3-5.\w{3}", r".*Лист-План 1 этажа. Корпус 11.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 6_План 2 этажа. Корпус 12": [r".*АР3-6.\w{3}", r".*Лист-План 2 этажа. Корпус 12.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 7_План 3-7 этажа. Корпус 12": [r".*АР3-7.\w{3}", r".*Лист-План 3-7 этажа. Корпус 12.\w{3}", r".*-Лист -.*План 3-7 этажа. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 8_План 8-13 этажа. Корпус 12": [r".*АР3-8.\w{3}", r".*Лист-План 8-13 этажа. Корпус 12.\w{3}", r".*-Лист -.*План 8-13 этажа. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 9_План 14-24 этажа. Корпус 12": [r".*АР3-9.\w{3}", r".*Лист-План 14-24 этажа. Корпус 12.\w{3}", r".*-Лист -.*План 14-24 этажа. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 10_План кровли. Корпус 12": [r".*АР3-10.\w{3}", r".*Лист-План кровли. Корпус 12.\w{3}", r".*-Лист -.*План кровли. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 11_План 2 этажа. Корпус 1": [r".*АР3-11.\w{3}", r".*Лист-План 2 этажа. Корпус 1.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 12_План 3-8 этажа. Корпус 1": [r".*АР3-12.\w{3}", r".*Лист-План 3-8 этажа. Корпус 1.\w{3}", r".*-Лист -.*План 3-8 этажа. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 13_План 9-13 этажа. Корпус 1": [r".*АР3-13.\w{3}", r".*Лист-План 9-13 этажа. Корпус 1.\w{3}", r".*-Лист -.*План 9-13 этажа. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 14_План 14-17 этажа. Корпус 1": [r".*АР3-14.\w{3}", r".*Лист-План 14-17 этажа. Корпус 1.\w{3}", r".*-Лист -.*План 14-17 этажа. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 15_План 18-30 этажа. Корпус 1": [r".*АР3-15.\w{3}", r".*Лист-План 18-30 этажа. Корпус 1.\w{3}", r".*-Лист -.*План 18-30 этажа. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 16_План кровли. Корпус 1": [r".*АР3-16.\w{3}", r".*Лист-План кровли. Корпус 1.\w{3}", r".*-Лист -.*План кровли. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 17_План 2 этажа. Корпус 2": [r".*АР3-17.\w{3}", r".*Лист-План 2 этажа. Корпус 2.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 18_План 3-8 этажа. Корпус 2": [r".*АР3-18.\w{3}", r".*Лист-План 3-8 этажа. Корпус 2.\w{3}", r".*-Лист -.*План 3-8 этажа. Корпус 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 19_План 9-13 этажа. Корпус 2": [r".*АР3-19.\w{3}", r".*Лист-План 9-13 этажа. Корпус 2.\w{3}", r".*-Лист -.*План 9-13 этажа. Корпус 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 20_План 14-17 этажа. Корпус 2": [r".*АР3-20.\w{3}", r".*Лист-План 14-17 этажа. Корпус 2.\w{3}", r".*-Лист -.*План 14-17 этажа. Корпус 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 21_План 18-30 этажа. Корпус 2": [r".*АР3-21.\w{3}", r".*Лист-План 18-30 этажа. Корпус 2.\w{3}", r".*-Лист -.*План 18-30 этажа. Корпус 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 22_План кровли. Корпус 2": [r".*АР3-22.\w{3}", r".*Лист-План кровли. Корпус 2.\w{3}", r".*-Лист -.*План кровли. Корпус 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 23_План 2 этажа. Корпус 3": [r".*АР3-23.\w{3}", r".*Лист-План 2 этажа. Корпус 3.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 24_План 3 этажа. Корпус 3": [r".*АР3-24.\w{3}", r".*Лист-План 3 этажа. Корпус 3.\w{3}", r".*-Лист -.*План 3 этажа. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 25_План 4-8 этажа. Корпус 3": [r".*АР3-25.\w{3}", r".*Лист-План 4-8 этажа. Корпус 3.\w{3}", r".*-Лист -.*План 4-8 этажа. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 26_План 9-10 этажа. Корпус 3": [r".*АР3-26.\w{3}", r".*Лист-План 9-10 этажа. Корпус 3.\w{3}", r".*-Лист -.*План 9-10 этажа. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 27_План 11-17 этажа. Корпус 3": [r".*АР3-27.\w{3}", r".*Лист-План 11-17 этажа. Корпус 3.\w{3}", r".*-Лист -.*План 11-17 этажа. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 28_План 18 этажа. Корпус 3": [r".*АР3-28.\w{3}", r".*Лист-План 18 этажа. Корпус 3.\w{3}", r".*-Лист -.*План 18 этажа. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 29_План 19-25 этажа. Корпус 3": [r".*АР3-29.\w{3}", r".*Лист-План 19-25 этажа. Корпус 3.\w{3}", r".*-Лист -.*План 19-25 этажа. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 30_План кровли. Корпус 3": [r".*АР3-30.\w{3}", r".*Лист-План кровли. Корпус 3.\w{3}", r".*-Лист -.*План кровли. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 31_План 2 этажа. Корпус 11": [r".*АР3-31.\w{3}", r".*Лист-План 2 этажа. Корпус 11.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 32_План 3-6 этажа. Корпус 11": [r".*АР3-32.\w{3}", r".*Лист-План 3-6 этажа. Корпус 11.\w{3}", r".*-Лист -.*План 3-6 этажа. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 33_План 7-10 этажа. Корпус 11": [r".*АР3-33.\w{3}", r".*Лист-План 7-10 этажа. Корпус 11.\w{3}", r".*-Лист -.*План 7-10 этажа. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 34_План 11-12 этажа. Корпус 11": [r".*АР3-34.\w{3}", r".*Лист-План 11-12 этажа. Корпус 11.\w{3}", r".*-Лист -.*План 11-12 этажа. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 35_План 13 этажа. Корпус 11": [r".*АР3-35.\w{3}", r".*Лист-План 13 этажа. Корпус 11.\w{3}", r".*-Лист -.*План 13 этажа. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 36_План 14-17 этажа. Корпус 11": [r".*АР3-36.\w{3}", r".*Лист-План 14-17 этажа. Корпус 11.\w{3}", r".*-Лист -.*План 14-17 этажа. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 37_План 18-23 этажа. Корпус 11": [r".*АР3-37.\w{3}", r".*Лист-План 18-23 этажа. Корпус 11.\w{3}", r".*-Лист -.*План 18-23 этажа. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 38_План кровли. Корпус 11": [r".*АР3-38.\w{3}", r".*Лист-План кровли. Корпус 11.\w{3}", r".*-Лист -.*План кровли. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 39_Разрез 1-1. Корпус 12": [r".*АР3-39.\w{3}", r".*Лист-Разрез 1-1. Корпус 12.\w{3}", r".*-Лист -.*Разрез 1-1. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 40_Разрез 2-2. Корпус 12": [r".*АР3-40.\w{3}", r".*Лист-Разрез 2-2. Корпус 12.\w{3}", r".*-Лист -.*Разрез 2-2. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 41_Разрез 3-3. Разрез 4-4. Корпус 1": [r".*АР3-41.\w{3}", r".*Лист-Разрез 3-3. Разрез 4-4. Корпус 1.\w{3}", r".*-Лист -.*Разрез 3-3. Разрез 4-4. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 42_Разрез 5-5. Разрез 6-6. Корпус 2": [r".*АР3-42.\w{3}", r".*Лист-Разрез 5-5. Разрез 6-6. Корпус 2.\w{3}", r".*-Лист -.*Разрез 5-5. Разрез 6-6. Корпус 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 43_Разрез 7-7. Разрез 8-8. Корпус 3": [r".*АР3-43.\w{3}", r".*Лист-Разрез 7-7. Разрез 8-8. Корпус 3.\w{3}", r".*-Лист -.*Разрез 7-7. Разрез 8-8. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 44_Разрез 9-9. Разрез 10-10. Корпус 3": [r".*АР3-44.\w{3}", r".*Лист-Разрез 9-9. Разрез 10-10. Корпус 3.\w{3}", r".*-Лист -.*Разрез 9-9. Разрез 10-10. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 45_Разрез 11-11. Корпус 3": [r".*АР3-45.\w{3}", r".*Лист-Разрез 11-11. Корпус 3.\w{3}", r".*-Лист -.*Разрез 11-11. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 46_Разрез 12-12. Разрез 13-13. Разрез 14-14. Корпус 11": [r".*АР3-46.\w{3}", r".*Лист-Разрез 12-12. Разрез 13-13. Разрез 14-14. Корпус 11.\w{3}", r".*-Лист -.*Разрез 12-12. Разрез 13-13. Разрез 14-14. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 47_Разрез 15-15. Корпус 11": [r".*АР3-47.\w{3}", r".*Лист-Разрез 15-15. Корпус 11.\w{3}", r".*-Лист -.*Разрез 15-15. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 48_Разрез 16-16. Корпус 11": [r".*АР3-48.\w{3}", r".*Лист-Разрез 16-16. Корпус 11.\w{3}", r".*-Лист -.*Разрез 16-16. Корпус 11.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 49_Фасад А-Н. Корпус 1. Корпус 12": [r".*АР3-49.\w{3}", r".*Лист-Фасад А-Н. Корпус 1. Корпус 12.\w{3}", r".*-Лист -.*Фасад А-Н. Корпус 1. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 50_Фасад 28-2. Корпус 3. Корпус 2. Корпус 1": [r".*АР3-50.\w{3}", r".*Лист-Фасад 28-2. Корпус 3. Корпус 2. Корпус 1.\w{3}", r".*-Лист -.*Фасад 28-2. Корпус 3. Корпус 2. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 51_Фасад Н-Ю. Корпус 3": [r".*АР3-51.\w{3}", r".*Лист-Фасад Н-Ю. Корпус 3.\w{3}", r".*-Лист -.*Фасад Н-Ю. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 52_Фасад 2-28. Корпус 12. Корпус 11. Корпус 3": [r".*АР3-52.\w{3}", r".*Лист-Фасад 2-28. Корпус 12. Корпус 11. Корпус 3.\w{3}", r".*-Лист -.*Фасад 2-28. Корпус 12. Корпус 11. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 53_Фасад Н-А. Корпус 12. Корпус 1": [r".*АР3-53.\w{3}", r".*Лист-Фасад Н-А. Корпус 12. Корпус 1.\w{3}", r".*-Лист -.*Фасад Н-А. Корпус 12. Корпус 1.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 54_Фасад 4-27. Корпус 1. Корпус 2. Корпус 3": [r".*АР3-54.\w{3}", r".*Лист-Фасад 4-27. Корпус 1. Корпус 2. Корпус 3.\w{3}", r".*-Лист -.*Фасад 4-27. Корпус 1. Корпус 2. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 55_Фасад Ю-Н. Корпус 3": [r".*АР3-55.\w{3}", r".*Лист-Фасад Ю-Н. Корпус 3.\w{3}", r".*-Лист -.*Фасад Ю-Н. Корпус 3.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 56_Фасад 27-2. Корпус 11. Корпус 12": [r".*АР3-56.\w{3}", r".*Лист-Фасад 27-2. Корпус 11. Корпус 12.\w{3}", r".*-Лист -.*Фасад 27-2. Корпус 11. Корпус 12.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 57_Фасад Я-Ш. Фасад Ш-Я. Корпус 2": [r".*АР3-57.\w{3}", r".*Лист-Фасад Я-Ш. Фасад Ш-Я. Корпус 2.\w{3}", r".*-Лист -.*Фасад Я-Ш. Фасад Ш-Я. Корпус 2.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР3_Лист 58_Фасад Р-Н. Фасад Н-Р. Корпус 11": [r".*АР3-58.\w{3}", r".*Лист-Фасад Р-Н. Фасад Н-Р. Корпус 11.\w{3}", r".*-Лист -.*Фасад Р-Н. Фасад Н-Р. Корпус 11.\w{3}",],

            "03.2 ППТ3-4-Д1-П-АР4_Лист 1_План 1 этажа. Корпус 4": [r".*АР4-1.\w{3}", r".*Лист-План 1 этажа. Корпус 4.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 2_План 1 этажа. Корпус 5": [r".*АР4-2.\w{3}", r".*Лист-План 1 этажа. Корпус 5.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 3_План 1 этажа. Корпус 6": [r".*АР4-3.\w{3}", r".*Лист-План 1 этажа. Корпус 6.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 4_План 1 этажа. Корпус 7": [r".*АР4-4.\w{3}", r".*Лист-План 1 этажа. Корпус 7.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 5_План 1 этажа. Корпус 8": [r".*АР4-5.\w{3}", r".*Лист-План 1 этажа. Корпус 8.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 6_План 1 этажа. Корпус 9": [r".*АР4-6.\w{3}", r".*Лист-План 1 этажа. Корпус 9.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 7_План 1 этажа. Корпус 10": [r".*АР4-7.\w{3}", r".*Лист-План 1 этажа. Корпус 10.\w{3}", r".*-Лист -.*План 1 этажа. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 8_План 2 этажа. Корпус 4": [r".*АР4-8.\w{3}", r".*Лист-План 2 этажа. Корпус 4.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 9_План 3-8 этажа. Корпус 4": [r".*АР4-9.\w{3}", r".*Лист-План 3-8 этажа. Корпус 4.\w{3}", r".*-Лист -.*План 3-8 этажа. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 10_План 9-10 этажа. Корпус 4": [r".*АР4-10.\w{3}", r".*Лист-План 9-10 этажа. Корпус 4.\w{3}", r".*-Лист -.*План 9-10 этажа. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 11_План 11-13 этажа. Корпус 4": [r".*АР4-11.\w{3}", r".*Лист-План 11-13 этажа. Корпус 4.\w{3}", r".*-Лист -.*План 11-13 этажа. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 12_План 14-17 этажа. Корпус 4": [r".*АР4-12.\w{3}", r".*Лист-План 14-17 этажа. Корпус 4.\w{3}", r".*-Лист -.*План 14-17 этажа. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 13_План 18 этажа. Корпус 4": [r".*АР4-13.\w{3}", r".*Лист-План 18 этажа. Корпус 4.\w{3}", r".*-Лист -.*План 18 этажа. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 14_План 19-30 этажа. Корпус 4": [r".*АР4-14.\w{3}", r".*Лист-План 19-30 этажа. Корпус 4.\w{3}", r".*-Лист -.*План 19-30 этажа. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 15_План кровли. Корпус 4": [r".*АР4-15.\w{3}", r".*Лист-План кровли. Корпус 4.\w{3}", r".*-Лист -.*План кровли. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 16_План 2 этажа. Корпус 5": [r".*АР4-16.\w{3}", r".*Лист-План 2 этажа. Корпус 5.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 17_План 3-7 этажа. Корпус 5": [r".*АР4-17.\w{3}", r".*Лист-План 3-7 этажа. Корпус 5.\w{3}", r".*-Лист -.*План 3-7 этажа. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 18_План 8-13 этажа. Корпус 5": [r".*АР4-18.\w{3}", r".*Лист-План 8-13 этажа. Корпус 5.\w{3}", r".*-Лист -.*План 8-13 этажа. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 19_План 14-24 этажа. Корпус 5": [r".*АР4-19.\w{3}", r".*Лист-План 14-24 этажа. Корпус 5.\w{3}", r".*-Лист -.*План 14-24 этажа. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 20_План кровли. Корпус 5": [r".*АР4-20.\w{3}", r".*Лист-План кровли. Корпус 5.\w{3}", r".*-Лист -.*План кровли. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 21_План 2 этажа. Корпус 6": [r".*АР4-21.\w{3}", r".*Лист-План 2 этажа. Корпус 6.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 22_План 3-8 этажа. Корпус 6": [r".*АР4-22.\w{3}", r".*Лист-План 3-8 этажа. Корпус 6.\w{3}", r".*-Лист -.*План 3-8 этажа. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 23_План 9-13 этажа. Корпус 6": [r".*АР4-23.\w{3}", r".*Лист-План 9-13 этажа. Корпус 6.\w{3}", r".*-Лист -.*План 9-13 этажа. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 24_План 14-17 этажа. Корпус 6": [r".*АР4-24.\w{3}", r".*Лист-План 14-17 этажа. Корпус 6.\w{3}", r".*-Лист -.*План 14-17 этажа. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 25_План 18-30 этажа. Корпус 6": [r".*АР4-25.\w{3}", r".*Лист-План 18-30 этажа. Корпус 6.\w{3}", r".*-Лист -.*План 18-30 этажа. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 26_План кровли. Корпус 6": [r".*АР4-26.\w{3}", r".*Лист-План кровли. Корпус 6.\w{3}", r".*-Лист -.*План кровли. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 27_План 2 этажа. Корпус 7": [r".*АР4-27.\w{3}", r".*Лист-План 2 этажа. Корпус 7.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 28_План 3-8 этажа. Корпус 7": [r".*АР4-28.\w{3}", r".*Лист-План 3-8 этажа. Корпус 7.\w{3}", r".*-Лист -.*План 3-8 этажа. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 29_План 9-13 этажа. Корпус 7": [r".*АР4-29.\w{3}", r".*Лист-План 9-13 этажа. Корпус 7.\w{3}", r".*-Лист -.*План 9-13 этажа. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 30_План 14-17 этажа. Корпус 7": [r".*АР4-30.\w{3}", r".*Лист-План 14-17 этажа. Корпус 7.\w{3}", r".*-Лист -.*План 14-17 этажа. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 31_План 18-30 этажа. Корпус 7": [r".*АР4-31.\w{3}", r".*Лист-План 18-30 этажа. Корпус 7.\w{3}", r".*-Лист -.*План 18-30 этажа. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 32_План кровли. Корпус 7": [r".*АР4-32.\w{3}", r".*Лист-План кровли. Корпус 7.\w{3}", r".*-Лист -.*План кровли. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 33_План 2 этажа. Корпус 8": [r".*АР4-33.\w{3}", r".*Лист-План 2 этажа. Корпус 8.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 34_План 3-7 этажа. Корпус 8": [r".*АР4-34.\w{3}", r".*Лист-План 3-7 этажа. Корпус 8.\w{3}", r".*-Лист -.*План 3-7 этажа. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 35_План 8-13 этажа. Корпус 8": [r".*АР4-35.\w{3}", r".*Лист-План 8-13 этажа. Корпус 8.\w{3}", r".*-Лист -.*План 8-13 этажа. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 36_План 14-24 этажа. Корпус 8": [r".*АР4-36.\w{3}", r".*Лист-План 14-24 этажа. Корпус 8.\w{3}", r".*-Лист -.*План 14-24 этажа. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 37_План кровли. Корпус 8": [r".*АР4-37.\w{3}", r".*Лист-План кровли. Корпус 8.\w{3}", r".*-Лист -.*План кровли. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 38_План 2 этажа. Корпус 9": [r".*АР4-38.\w{3}", r".*Лист-План 2 этажа. Корпус 9.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 39_План 3-8 этажа. Корпус 9": [r".*АР4-39.\w{3}", r".*Лист-План 3-8 этажа. Корпус 9.\w{3}", r".*-Лист -.*План 3-8 этажа. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 40_План 9-13 этажа. Корпус 9": [r".*АР4-40.\w{3}", r".*Лист-План 9-13 этажа. Корпус 9.\w{3}", r".*-Лист -.*План 9-13 этажа. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 41_План 14-17 этажа. Корпус 9": [r".*АР4-41.\w{3}", r".*Лист-План 14-17 этажа. Корпус 9.\w{3}", r".*-Лист -.*План 14-17 этажа. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 42_План 18-30 этажа. Корпус 9": [r".*АР4-42.\w{3}", r".*Лист-План 18-30 этажа. Корпус 9.\w{3}", r".*-Лист -.*План 18-30 этажа. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 43_План кровли. Корпус 9": [r".*АР4-43.\w{3}", r".*Лист-План кровли. Корпус 9.\w{3}", r".*-Лист -.*План кровли. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 44_План 2 этажа. Корпус 10": [r".*АР4-44.\w{3}", r".*Лист-План 2 этажа. Корпус 10.\w{3}", r".*-Лист -.*План 2 этажа. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 45_План 3-6 этажа. Корпус 10": [r".*АР4-45.\w{3}", r".*Лист-План 3-6 этажа. Корпус 10.\w{3}", r".*-Лист -.*План 3-6 этажа. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 46_План 7-10 этажа. Корпус 10": [r".*АР4-46.\w{3}", r".*Лист-План 7-10 этажа. Корпус 10.\w{3}", r".*-Лист -.*План 7-10 этажа. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 47_План 11-15 этажа. Корпус 10": [r".*АР4-47.\w{3}", r".*Лист-План 11-15 этажа. Корпус 10.\w{3}", r".*-Лист -.*План 11-15 этажа. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 48_План 16 этажа. Корпус 10": [r".*АР4-48.\w{3}", r".*Лист-План 16 этажа. Корпус 10.\w{3}", r".*-Лист -.*План 16 этажа. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 49_План 17 этажа. Корпус 10": [r".*АР4-49.\w{3}", r".*Лист-План 17 этажа. Корпус 10.\w{3}", r".*-Лист -.*План 17 этажа. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 50_План 18-23 этажа. Корпус 10": [r".*АР4-50.\w{3}", r".*Лист-План 18-23 этажа. Корпус 10.\w{3}", r".*-Лист -.*План 18-23 этажа. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 51_План кровли. Корпус 10": [r".*АР4-51.\w{3}", r".*Лист-План кровли. Корпус 10.\w{3}", r".*-Лист -.*План кровли. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 52_Разрез 1-1. Разрез 2-2. Корпус 4": [r".*АР4-52.\w{3}", r".*Лист-Разрез 1-1. Разрез 2-2. Корпус 4.\w{3}", r".*-Лист -.*Разрез 1-1. Разрез 2-2. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 53_Разрез 3-3. Корпус 4": [r".*АР4-53.\w{3}", r".*Лист-Разрез 3-3. Корпус 4.\w{3}", r".*-Лист -.*Разрез 3-3. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 54_Разрез 4-4. Корпус 5": [r".*АР4-54.\w{3}", r".*Лист-Разрез 4-4. Корпус 5.\w{3}", r".*-Лист -.*Разрез 4-4. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 55_Разрез 5-5. Корпус 5": [r".*АР4-55.\w{3}", r".*Лист-Разрез 5-5. Корпус 5.\w{3}", r".*-Лист -.*Разрез 5-5. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 56_Разрез 6-6. Корпус 6": [r".*АР4-56.\w{3}", r".*Лист-Разрез 6-6. Корпус 6.\w{3}", r".*-Лист -.*Разрез 6-6. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 57_Разрез 7-7. Корпус 6": [r".*АР4-57.\w{3}", r".*Лист-Разрез 7-7. Корпус 6.\w{3}", r".*-Лист -.*Разрез 7-7. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 58_Разрез 8-8. Корпус 7": [r".*АР4-58.\w{3}", r".*Лист-Разрез 8-8. Корпус 7.\w{3}", r".*-Лист -.*Разрез 8-8. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 59_Разрез 9-9. Корпус 7": [r".*АР4-59.\w{3}", r".*Лист-Разрез 9-9. Корпус 7.\w{3}", r".*-Лист -.*Разрез 9-9. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 60_Разрез 10-10. Корпус 8": [r".*АР4-60.\w{3}", r".*Лист-Разрез 10-10. Корпус 8.\w{3}", r".*-Лист -.*Разрез 10-10. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 61_Разрез 11-11. Корпус 8": [r".*АР4-61.\w{3}", r".*Лист-Разрез 11-11. Корпус 8.\w{3}", r".*-Лист -.*Разрез 11-11. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 62_Разрез 12-12. Корпус 9": [r".*АР4-62.\w{3}", r".*Лист-Разрез 12-12. Корпус 9.\w{3}", r".*-Лист -.*Разрез 12-12. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 63_Разрез 13-13. Корпус 9": [r".*АР4-63.\w{3}", r".*Лист-Разрез 13-13. Корпус 9.\w{3}", r".*-Лист -.*Разрез 13-13. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 64_Разрез 14-14. Разрез 15-15. Разрез 16-16. Корпус 10": [r".*АР4-64.\w{3}", r".*Лист-Разрез 14-14. Разрез 15-15. Разрез 16-16. Корпус 10.\w{3}", r".*-Лист -.*Разрез 14-14. Разрез 15-15. Разрез 16-16. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 65_Разрез 17-17. Корпус 10": [r".*АР4-65.\w{3}", r".*Лист-Разрез 17-17. Корпус 10.\w{3}", r".*-Лист -.*Разрез 17-17. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 66_Разрез 18-18. Корпус 10": [r".*АР4-66.\w{3}", r".*Лист-Разрез 18-18. Корпус 10.\w{3}", r".*-Лист -.*Разрез 18-18. Корпус 10.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 67_Фасад Б-М. Корпус 5. Корпус 4": [r".*АР4-67.\w{3}", r".*Лист-Фасад Б-М. Корпус 5. Корпус 4.\w{3}", r".*-Лист -.*Фасад Б-М. Корпус 5. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 68_Фасад 1-28. Корпус 8. Корпус 7. Корпус 6. Корпус 5": [r".*АР4-68.\w{3}", r".*Лист-Фасад 1-28. Корпус 8. Корпус 7. Корпус 6. Корпус 5.\w{3}", r".*-Лист -.*Фасад 1-28. Корпус 8. Корпус 7. Корпус 6. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 69_Фасад М-А. Корпус 9. Корпус 8": [r".*АР4-69.\w{3}", r".*Лист-Фасад М-А. Корпус 9. Корпус 8.\w{3}", r".*-Лист -.*Фасад М-А. Корпус 9. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 70_Фасад 28-1. Корпус 4. Корпус 10. Корпус 9": [r".*АР4-70.\w{3}", r".*Лист-Фасад 28-1. Корпус 4. Корпус 10. Корпус 9.\w{3}", r".*-Лист -.*Фасад 28-1. Корпус 4. Корпус 10. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 71_Фасад М-Б. Корпус 4. Корпус 5": [r".*АР4-71.\w{3}", r".*Лист-Фасад М-Б. Корпус 4. Корпус 5.\w{3}", r".*-Лист -.*Фасад М-Б. Корпус 4. Корпус 5.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 72_Фасад 28-1. Корпус 5. Корпус 6. Корпус 7. Корпус 8": [r".*АР4-72.\w{3}", r".*Лист-Фасад 28-1. Корпус 5. Корпус 6. Корпус 7. Корпус 8.\w{3}", r".*-Лист -.*Фасад 28-1. Корпус 5. Корпус 6. Корпус 7. Корпус 8.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 73_Фасад А-М. Корпус 8. Корпус 9": [r".*АР4-73.\w{3}", r".*Лист-Фасад А-М. Корпус 8. Корпус 9.\w{3}", r".*-Лист -.*Фасад А-М. Корпус 8. Корпус 9.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 74_Фасад 1-28. Корпус 9. Корпус 10. Корпус 4": [r".*АР4-74.\w{3}", r".*Лист-Фасад 1-28. Корпус 9. Корпус 10. Корпус 4.\w{3}", r".*-Лист -.*Фасад 1-28. Корпус 9. Корпус 10. Корпус 4.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 75_Фасад Б-В. Фасад В-Б. Корпус 6": [r".*АР4-75.\w{3}", r".*Лист-Фасад Б-В. Фасад В-Б. Корпус 6.\w{3}", r".*-Лист -.*Фасад Б-В. Фасад В-Б. Корпус 6.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 76_Фасад Б-В. Фасад В-Б. Корпус 7": [r".*АР4-76.\w{3}", r".*Лист-Фасад Б-В. Фасад В-Б. Корпус 7.\w{3}", r".*-Лист -.*Фасад Б-В. Фасад В-Б. Корпус 7.\w{3}",],
            "03.2 ППТ3-4-Д1-П-АР4_Лист 77_Фасад М-Л. Фасад Л-М. Корпус 10": [r".*АР4-77.\w{3}", r".*Лист-Фасад М-Л. Фасад Л-М. Корпус 10.\w{3}", r".*-Лист -.*Фасад М-Л. Фасад Л-М. Корпус 10.\w{3}",],
            }
#auto-py-to-exe
#T:\Проектный институт\Группа архитекторов\Группа АР БКП\LETV-01\05_ПД\Раздел 3.  Объемно-планировочные и архитектурные решения\
def replace_file(full_filename_now,full_filename_new):
    """
    Функция переноса файлов
    """
    file = os.path.basename(full_filename_now)
    time_ = datetime.datetime.now().replace(microsecond=0)
    dir_now = os.path.basename(os.path.dirname(full_filename_now))
    dir_new = os.path.basename(os.path.dirname(full_filename_new))
    print(f"Перенесли     {dir_now}:{file[:5]}...{file[-30:]} --> в папку {dir_new}. Время: {time_}")
    # os.replace(full_filename_now, full_filename_new)
    
def dict_right_filename(find_name):
    """Подбирает к неправильному имени правильное"""
    strip_name, file_extension = os.path.splitext(find_name)
    if pattern_all(find_name):
        for keys, values in dict_name.items():
            bool_rename = re.fullmatch(values[2], find_name)
            if bool_rename == None:
                bool_rename = re.fullmatch(values[1], find_name)
                if bool_rename == None:
                    bool_rename = re.fullmatch(values[0], find_name)
                    print(values[1])
                    print(values[0])
            if bool_rename:
                right_filename = keys + file_extension
                # print(f"Переименовали фаил {find_name} --> {right_filename}")
                return right_filename

           
def main():
    directory = os.path.abspath(os.getcwd())
    directory_dwg = os.path.join(directory, "PDF/DWG")
    directory_pdf = os.path.join(directory, "PDF")
    #list_dir = [directory_pdf, directory_dwg, directory]

    from_PDF = read_dir(directory_pdf) #Файлы из папки PDF
    from_DWG = read_dir(directory_dwg) #Файлы из папки DWG
    
    for file in from_DWG:
        on_rename = dict_right_filename(file)
        full_file = os.path.join("PDF/DWG", file)
        if on_rename != None:
            full_on_rename = os.path.join("PDF/DWG", on_rename)
            if on_rename in from_DWG:
                print(f"Удален        {on_rename}")
                os.remove(full_on_rename)

        
            
    for file in from_DWG:
        on_rename = dict_right_filename(file)
        full_file = os.path.join("PDF/DWG", file)
        if on_rename != None:
            full_on_rename = os.path.join("PDF/DWG", on_rename)
            print(f"Переименовали {file} --> {on_rename[:25]}...{on_rename[-30:]}")
            os.rename(full_file, full_on_rename)
            # print(f"Переименовка True")


  
    for file in from_DWG:
        full_name = os.path.join("PDF/DWG", file)
        full_name_new = os.path.join("PDF", file)
        #Ищем НЕ PDF файлы, после чего запускаем удаление/перемещение
     
        if pattern_(file):
            replace_file(full_name, full_name_new)



while(True):
    # main()
    try:
        main()
    except Exception:
        time.sleep(10)
    time.sleep(10)
    
